Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71N21.xml
        <register caption="Screening Type 2 Ethertype Register  (index = 0) 3" name="GMAC_ST2ER3" offset="0x6EC" rw="RW" size="4">
          <bitfield caption="Ethertype Compare Value" mask="0x0000FFFF" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 0)" name="GMAC_ST2CW00" offset="0x700" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 0)" name="GMAC_ST2CW10" offset="0x704" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW10__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 1)" name="GMAC_ST2CW01" offset="0x708" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 1)" name="GMAC_ST2CW11" offset="0x70C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW11__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 2)" name="GMAC_ST2CW02" offset="0x710" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 2)" name="GMAC_ST2CW12" offset="0x714" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW12__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 3)" name="GMAC_ST2CW03" offset="0x718" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 3)" name="GMAC_ST2CW13" offset="0x71C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW13__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 4)" name="GMAC_ST2CW04" offset="0x720" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 4)" name="GMAC_ST2CW14" offset="0x724" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW14__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 5)" name="GMAC_ST2CW05" offset="0x728" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 5)" name="GMAC_ST2CW15" offset="0x72C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW15__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 6)" name="GMAC_ST2CW06" offset="0x730" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 6)" name="GMAC_ST2CW16" offset="0x734" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW16__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 7)" name="GMAC_ST2CW07" offset="0x738" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 7)" name="GMAC_ST2CW17" offset="0x73C" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW17__OFFSSTRT"/>
        </register>
        <register caption="Screening Type 2 Compare Word 0 Register  (index = 8)" name="GMAC_ST2CW08" offset="0x740" rw="RW" size="4">
          <bitfield caption="Mask Value" mask="0x0000FFFF" name="MASKVAL"/>
          <bitfield caption="Compare Value" mask="0xFFFF0000" name="COMPVAL"/>
        </register>
        <register caption="Screening Type 2 Compare Word 1 Register  (index = 8)" name="GMAC_ST2CW18" offset="0x744" rw="RW" size="4">
          <bitfield caption="Offset Value in Bytes" mask="0x0000007F" name="OFFSVAL"/>
          <bitfield caption="Ethernet Frame Offset Start" mask="0x00000180" name="OFFSSTRT" values="GMAC_ST2CW18__OFFSSTRT"/>
        </register>
