Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71N21.xml
        <register caption="SleepWalking Enable Register 1" name="PMC_SLPWK_ER1" offset="0x0134" rw="W" size="4">
          <bitfield caption="Peripheral 32 SleepWalking Enable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral 33 SleepWalking Enable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral 34 SleepWalking Enable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral 35 SleepWalking Enable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral 37 SleepWalking Enable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral 39 SleepWalking Enable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral 40 SleepWalking Enable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral 41 SleepWalking Enable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral 42 SleepWalking Enable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral 43 SleepWalking Enable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral 44 SleepWalking Enable" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral 45 SleepWalking Enable" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral 46 SleepWalking Enable" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral 47 SleepWalking Enable" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral 48 SleepWalking Enable" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral 49 SleepWalking Enable" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral 50 SleepWalking Enable" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral 51 SleepWalking Enable" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral 52 SleepWalking Enable" mask="0x00100000" name="PID52"/>
          <bitfield caption="Peripheral 53 SleepWalking Enable" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral 56 SleepWalking Enable" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral 57 SleepWalking Enable" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral 58 SleepWalking Enable" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral 59 SleepWalking Enable" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral 60 SleepWalking Enable" mask="0x10000000" name="PID60"/>
        </register>
        <register caption="SleepWalking Disable Register 1" name="PMC_SLPWK_DR1" offset="0x0138" rw="W" size="4">
          <bitfield caption="Peripheral 32 SleepWalking Disable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral 33 SleepWalking Disable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral 34 SleepWalking Disable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral 35 SleepWalking Disable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral 37 SleepWalking Disable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral 39 SleepWalking Disable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral 40 SleepWalking Disable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral 41 SleepWalking Disable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral 42 SleepWalking Disable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral 43 SleepWalking Disable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral 44 SleepWalking Disable" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral 45 SleepWalking Disable" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral 46 SleepWalking Disable" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral 47 SleepWalking Disable" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral 48 SleepWalking Disable" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral 49 SleepWalking Disable" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral 50 SleepWalking Disable" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral 51 SleepWalking Disable" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral 52 SleepWalking Disable" mask="0x00100000" name="PID52"/>
          <bitfield caption="Peripheral 53 SleepWalking Disable" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral 56 SleepWalking Disable" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral 57 SleepWalking Disable" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral 58 SleepWalking Disable" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral 59 SleepWalking Disable" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral 60 SleepWalking Disable" mask="0x10000000" name="PID60"/>
        </register>
        <register caption="SleepWalking Status Register 1" name="PMC_SLPWK_SR1" offset="0x013C" rw="R" size="4">
          <bitfield caption="Peripheral 32 SleepWalking Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral 33 SleepWalking Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral 34 SleepWalking Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral 35 SleepWalking Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral 37 SleepWalking Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral 39 SleepWalking Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral 40 SleepWalking Status" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral 41 SleepWalking Status" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral 42 SleepWalking Status" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral 43 SleepWalking Status" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral 44 SleepWalking Status" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral 45 SleepWalking Status" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral 46 SleepWalking Status" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral 47 SleepWalking Status" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral 48 SleepWalking Status" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral 49 SleepWalking Status" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral 50 SleepWalking Status" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral 51 SleepWalking Status" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral 52 SleepWalking Status" mask="0x00100000" name="PID52"/>
          <bitfield caption="Peripheral 53 SleepWalking Status" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral 56 SleepWalking Status" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral 57 SleepWalking Status" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral 58 SleepWalking Status" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral 59 SleepWalking Status" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral 60 SleepWalking Status" mask="0x10000000" name="PID60"/>
        </register>
        <register caption="SleepWalking Activity Status Register 1" name="PMC_SLPWK_ASR1" offset="0x0140" rw="R" size="4">
          <bitfield caption="Peripheral 32 Activity Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral 33 Activity Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral 34 Activity Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral 35 Activity Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral 37 Activity Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral 39 Activity Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral 40 Activity Status" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral 41 Activity Status" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral 42 Activity Status" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral 43 Activity Status" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral 44 Activity Status" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral 45 Activity Status" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral 46 Activity Status" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral 47 Activity Status" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral 48 Activity Status" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral 49 Activity Status" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral 50 Activity Status" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral 51 Activity Status" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral 52 Activity Status" mask="0x00100000" name="PID52"/>
          <bitfield caption="Peripheral 53 Activity Status" mask="0x00200000" name="PID53"/>
          <bitfield caption="Peripheral 56 Activity Status" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral 57 Activity Status" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral 58 Activity Status" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral 59 Activity Status" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral 60 Activity Status" mask="0x10000000" name="PID60"/>
        </register>
        <register caption="SleepWalking Activity In Progress Register" name="PMC_SLPWK_AIPR" offset="0x0144" rw="R" size="4">
          <bitfield caption="Activity In Progress" mask="0x00000001" name="AIP"/>
        </register>
      </register-group>
