Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71N21.xml
        <register caption="LON Beta1 Tx Register" name="US_LONB1TX" offset="0x0074" rw="RW" size="4">
          <bitfield caption="LON Beta1 Length after Transmission" mask="0x00FFFFFF" name="BETA1TX"/>
        </register>
        <register caption="LON Beta1 Rx Register" name="US_LONB1RX" offset="0x0078" rw="RW" size="4">
          <bitfield caption="LON Beta1 Length after Reception" mask="0x00FFFFFF" name="BETA1RX"/>
        </register>
        <register caption="LON Priority Register" name="US_LONPRIO" offset="0x007C" rw="RW" size="4">
          <bitfield caption="LON Priority Slot Number" mask="0x0000007F" name="PSNB"/>
          <bitfield caption="LON Node Priority Slot" mask="0x00007F00" name="NPS"/>
        </register>
        <register caption="LON IDT Tx Register" name="US_IDTTX" offset="0x0080" rw="RW" size="4">
          <bitfield caption="LON Indeterminate Time after Transmission (comm_type = 1 mode only)" mask="0x00FFFFFF" name="IDTTX"/>
        </register>
        <register caption="LON IDT Rx Register" name="US_IDTRX" offset="0x0084" rw="RW" size="4">
          <bitfield caption="LON Indeterminate Time after Reception (comm_type = 1 mode only)" mask="0x00FFFFFF" name="IDTRX"/>
        </register>
        <register caption="IC DIFF Register" name="US_ICDIFF" offset="0x0088" rw="RW" size="4">
          <bitfield caption="IC Differentiator Number" mask="0x0000000F" name="ICDIFF"/>
        </register>
        <register caption="Write Protection Mode Register" name="US_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="US_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="US_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="US_MR__USART_MODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="RS485" name="RS485" value="0x1"/>
        <value caption="Hardware Handshaking" name="HW_HANDSHAKING" value="0x2"/>
        <value caption="LON" name="LON" value="0x9"/>
        <value caption="SPI master" name="SPI_MASTER" value="0xE"/>
        <value caption="SPI Slave" name="SPI_SLAVE" value="0xF"/>
      </value-group>
      <value-group caption="" name="US_MR__USCLKS">
        <value caption="Peripheral clock is selected" name="MCK" value="0x0"/>
        <value caption="Peripheral clock divided (DIV=DIV=8) is selected" name="DIV" value="0x1"/>
        <value caption="PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1." name="PCK" value="0x2"/>
        <value caption="Serial clock (SCK) is selected" name="SCK" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MR__CHRL">
        <value caption="Character length is 5 bits" name="_5_BIT" value="0x0"/>
        <value caption="Character length is 6 bits" name="_6_BIT" value="0x1"/>
        <value caption="Character length is 7 bits" name="_7_BIT" value="0x2"/>
        <value caption="Character length is 8 bits" name="_8_BIT" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MR__PAR">
        <value caption="Even parity" name="EVEN" value="0x0"/>
        <value caption="Odd parity" name="ODD" value="0x1"/>
        <value caption="Parity forced to 0 (Space)" name="SPACE" value="0x2"/>
        <value caption="Parity forced to 1 (Mark)" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
        <value caption="Multidrop mode" name="MULTIDROP" value="0x6"/>
      </value-group>
      <value-group caption="" name="US_MR__NBSTOP">
        <value caption="1 stop bit" name="_1_BIT" value="0x0"/>
        <value caption="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" name="_1_5_BIT" value="0x1"/>
        <value caption="2 stop bits" name="_2_BIT" value="0x2"/>
      </value-group>
      <value-group caption="" name="US_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic Echo. Receiver input is connected to the TXD pin." name="AUTOMATIC" value="0x1"/>
        <value caption="Local Loopback. Transmitter output is connected to the Receiver Input." name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote Loopback. RXD pin is internally connected to the TXD pin." name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MAN__TX_PP">
        <value caption="The preamble is composed of '1's" name="ALL_ONE" value="0x0"/>
        <value caption="The preamble is composed of '0's" name="ALL_ZERO" value="0x1"/>
        <value caption="The preamble is composed of '01's" name="ZERO_ONE" value="0x2"/>
        <value caption="The preamble is composed of '10's" name="ONE_ZERO" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_MAN__RX_PP">
        <value caption="The preamble is composed of '1's" name="ALL_ONE" value="0x0"/>
        <value caption="The preamble is composed of '0's" name="ALL_ZERO" value="0x1"/>
        <value caption="The preamble is composed of '01's" name="ZERO_ONE" value="0x2"/>
        <value caption="The preamble is composed of '10's" name="ONE_ZERO" value="0x3"/>
      </value-group>
      <value-group caption="" name="US_LINMR__NACT">
        <value caption="The USART transmits the response." name="PUBLISH" value="0x0"/>
        <value caption="The USART receives the response." name="SUBSCRIBE" value="0x1"/>
        <value caption="The USART does not transmit and does not receive the response." name="IGNORE" value="0x2"/>
      </value-group>
      <value-group caption="" name="US_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x555341"/>
      </value-group>
    </module>
    <module caption="USB High-Speed Interface" name="USBHS" version="11292A">
      <register-group name="USBHS">
        <register caption="Device General Control Register" name="USBHS_DEVCTRL" offset="0x0000" rw="RW" size="4">
          <bitfield caption="USB Address" mask="0x0000007F" name="UADD"/>
          <bitfield caption="Address Enable" mask="0x00000080" name="ADDEN"/>
          <bitfield caption="Detach" mask="0x00000100" name="DETACH"/>
          <bitfield caption="Remote Wake-Up" mask="0x00000200" name="RMWKUP"/>
          <bitfield caption="Mode Configuration" mask="0x00000C00" name="SPDCONF" values="USBHS_DEVCTRL__SPDCONF"/>
          <bitfield caption="Low-Speed Mode Force" mask="0x00001000" name="LS"/>
          <bitfield caption="Test mode J" mask="0x00002000" name="TSTJ"/>
          <bitfield caption="Test mode K" mask="0x00004000" name="TSTK"/>
          <bitfield caption="Test packet mode" mask="0x00008000" name="TSTPCKT"/>
          <bitfield caption="Specific Operational mode" mask="0x00010000" name="OPMODE2"/>
        </register>
        <register caption="Device Global Interrupt Status Register" name="USBHS_DEVISR" offset="0x0004" rw="R" size="4">
          <bitfield caption="Suspend Interrupt" mask="0x00000001" name="SUSP"/>
          <bitfield caption="Micro Start of Frame Interrupt" mask="0x00000002" name="MSOF"/>
          <bitfield caption="Start of Frame Interrupt" mask="0x00000004" name="SOF"/>
          <bitfield caption="End of Reset Interrupt" mask="0x00000008" name="EORST"/>
          <bitfield caption="Wake-Up Interrupt" mask="0x00000010" name="WAKEUP"/>
          <bitfield caption="End of Resume Interrupt" mask="0x00000020" name="EORSM"/>
          <bitfield caption="Upstream Resume Interrupt" mask="0x00000040" name="UPRSM"/>
          <bitfield caption="Endpoint 0 Interrupt" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="Endpoint 10 Interrupt" mask="0x00400000" name="PEP_10"/>
          <bitfield caption="Endpoint 11 Interrupt" mask="0x00800000" name="PEP_11"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Device Global Interrupt Clear Register" name="USBHS_DEVICR" offset="0x0008" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Clear" mask="0x00000001" name="SUSPC"/>
          <bitfield caption="Micro Start of Frame Interrupt Clear" mask="0x00000002" name="MSOFC"/>
          <bitfield caption="Start of Frame Interrupt Clear" mask="0x00000004" name="SOFC"/>
          <bitfield caption="End of Reset Interrupt Clear" mask="0x00000008" name="EORSTC"/>
          <bitfield caption="Wake-Up Interrupt Clear" mask="0x00000010" name="WAKEUPC"/>
          <bitfield caption="End of Resume Interrupt Clear" mask="0x00000020" name="EORSMC"/>
          <bitfield caption="Upstream Resume Interrupt Clear" mask="0x00000040" name="UPRSMC"/>
        </register>
        <register caption="Device Global Interrupt Set Register" name="USBHS_DEVIFR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Set" mask="0x00000001" name="SUSPS"/>
          <bitfield caption="Micro Start of Frame Interrupt Set" mask="0x00000002" name="MSOFS"/>
          <bitfield caption="Start of Frame Interrupt Set" mask="0x00000004" name="SOFS"/>
          <bitfield caption="End of Reset Interrupt Set" mask="0x00000008" name="EORSTS"/>
          <bitfield caption="Wake-Up Interrupt Set" mask="0x00000010" name="WAKEUPS"/>
          <bitfield caption="End of Resume Interrupt Set" mask="0x00000020" name="EORSMS"/>
          <bitfield caption="Upstream Resume Interrupt Set" mask="0x00000040" name="UPRSMS"/>
          <bitfield caption="DMA Channel 1 Interrupt Set" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Set" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Set" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Set" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Set" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Set" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Set" mask="0x80000000" name="DMA_7"/>
        </register>
