Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71N21.xml
        <register caption="Device Endpoint Status Register (n = 0) 5" name="USBHS_DEVEPTISR5" offset="0x144" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 6" name="USBHS_DEVEPTISR6" offset="0x148" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 7" name="USBHS_DEVEPTISR7" offset="0x14C" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 8" name="USBHS_DEVEPTISR8" offset="0x150" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 9" name="USBHS_DEVEPTISR9" offset="0x154" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 0" name="USBHS_DEVEPTICR0" offset="0x160" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
